target/test-classes/requests/authRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:zimbra" xmlns:urn1="urn:zimbraAdmin">
   <soapenv:Header>
      
   </soapenv:Header>
   <soapenv:Body>
    <urn1:AuthRequest>
	    <urn1:account by="name">#(username)</urn1:account>
	    <urn1:password>#(password)</urn1:password>
	 </urn1:AuthRequest>
   </soapenv:Body>
</soapenv:Envelope>