target/karate-reports/features.Login.karate-json.txt

{"failedCount":2,"prefixedPath":"classpath:features\/Login.feature","packageQualifiedName":"features.Login","loopIndex":-1,"relativePath":"features\/Login.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":1808600,"startTime":1753632697300,"endTime":1753632697302,"millis":1.8086,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url adminSoapUrl"},"stepLog":"21:41:37.240 🔢 Users to create: 5 \n"},{"result":{"nanos":5105600,"startTime":1753632697310,"endTime":1753632697315,"millis":5.1056,"status":"passed"},"step":{"line":8,"prefix":"*","index":0,"text":"def username = 'admin@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":2907200,"startTime":1753632697315,"endTime":1753632697318,"millis":2.9072,"status":"passed"},"step":{"line":9,"prefix":"*","index":1,"text":"def password = 'z1mbr4@123'"}},{"result":{"nanos":1396900,"startTime":1753632697319,"endTime":1753632697320,"millis":1.3969,"status":"passed"},"step":{"line":10,"prefix":"*","index":2,"text":"def authType = 'name'"}},{"result":{"nanos":76903700,"startTime":1753632697321,"endTime":1753632697398,"millis":76.9037,"status":"passed"},"step":{"line":11,"prefix":"*","index":3,"text":"def soaprequest = karate.read('classpath:requests\/authRequest.xml')"}},{"result":{"nanos":3119200,"startTime":1753632697397,"endTime":1753632697400,"millis":3.1192,"status":"passed"},"step":{"line":12,"prefix":"Given","index":4,"text":"request soaprequest"}},{"result":{"nanos":1671000,"startTime":1753632697400,"endTime":1753632697402,"millis":1.671,"status":"passed"},"step":{"line":13,"prefix":"And","index":5,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":477258500,"startTime":1753632697403,"endTime":1753632697880,"millis":477.2585,"status":"passed"},"step":{"line":14,"prefix":"*","index":6,"text":"configure ssl = true"}},{"result":{"nanos":1344701400,"startTime":1753632697880,"endTime":1753632699225,"millis":1344.7014,"status":"passed"},"step":{"line":15,"prefix":"When","index":7,"text":"method POST"},"stepLog":"21:41:38.390 request:\n1 > POST https:\/\/80.225.207.85:9071\/service\/admin\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 421\n1 > Host: 80.225.207.85:9071\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soapenv:Envelope xmlns:soapenv=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\" xmlns:urn=\"urn:zimbra\" xmlns:urn1=\"urn:zimbraAdmin\">\r\n   <soapenv:Header>\r\n      \r\n   <\/soapenv:Header>\r\n   <soapenv:Body>\r\n    <urn1:AuthRequest>\r\n\t    <urn1:account by=\"name\">admin@qa-u56-singlenode-ps.eng.zimbra.com<\/urn1:account>\r\n\t    <urn1:password>z1mbr4@123<\/urn1:password>\r\n\t <\/urn1:AuthRequest>\r\n   <\/soapenv:Body>\r\n<\/soapenv:Envelope>\n\n21:41:39.215 response time in milliseconds: 814\n1 < 200\n1 < Server: nginx\n1 < Date: Sun, 27 Jul 2025 16:11:36 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 620\n1 < Connection: keep-alive\n1 < Set-Cookie: ZM_ADMIN_AUTH_TOKEN=0_c35ee607f80684ecb241168c1a6ddbf5c82cb846_69643d33363a66303961323834382d363834392d343164632d386666662d3733306134376466613630373b6578703d31333a313735333637353839363239353b61646d696e3d313a313b747970653d363a7a696d6272613b753d313a613b7469643d31303a323134333932323132333b76657273696f6e3d31343a31302e312e305f47415f343635353b; Path=\/; Secure; HttpOnly\n1 < Expires: Thu, 01 Jan 1970 00:00:00 GMT\n1 < Cache-Control: no-store, no-cache\n1 < Vary: Accept-Encoding, User-Agent\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"><change token=\"5519\"\/><\/context><\/soap:Header><soap:Body><AuthResponse xmlns=\"urn:zimbraAdmin\"><lifetime>43199999<\/lifetime><authToken>0_c35ee607f80684ecb241168c1a6ddbf5c82cb846_69643d33363a66303961323834382d363834392d343164632d386666662d3733306134376466613630373b6578703d31333a313735333637353839363239353b61646d696e3d313a313b747970653d363a7a696d6272613b753d313a613b7469643d31303a323134333932323132333b76657273696f6e3d31343a31302e312e305f47415f343635353b<\/authToken><\/AuthResponse><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":11106000,"startTime":1753632699225,"endTime":1753632699236,"millis":11.106,"status":"passed"},"step":{"line":16,"prefix":"Then","index":8,"text":"status 200"}},{"result":{"nanos":108713300,"startTime":1753632699237,"endTime":1753632699346,"millis":108.7133,"status":"passed"},"step":{"line":17,"prefix":"*","index":9,"text":"def authToken = karate.xmlPath(response, '\/\/authToken')"}},{"result":{"nanos":3528800,"startTime":1753632699345,"endTime":1753632699349,"millis":3.5288,"status":"passed"},"step":{"line":18,"prefix":"*","index":10,"text":"print 'Auth Token is:', authToken"},"stepLog":"21:41:39.347 [print] Auth Token is: 0_c35ee607f80684ecb241168c1a6ddbf5c82cb846_69643d33363a66303961323834382d363834392d343164632d386666662d3733306134376466613630373b6578703d31333a313735333637353839363239353b61646d696e3d313a313b747970653d363a7a696d6272613b753d313a613b7469643d31303a323134333932323132333b76657273696f6e3d31343a31302e312e305f47415f343635353b \n"}],"line":21,"description":"","durationMillis":2038.2202,"failed":false,"tags":["authTokenGeneration_Valid"],"executorName":"main","name":"Zimbra user login","startTime":1753632697124,"refId":"[1.1:21]","endTime":1753632699350,"exampleData":{"username":"admin@qa-u56-singlenode-ps.eng.zimbra.com","password":"z1mbr4@123","authType":"name"},"exampleIndex":0},{"sectionIndex":0,"stepResults":[{"result":{"nanos":1085900,"startTime":1753632699381,"endTime":1753632699382,"millis":1.0859,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url adminSoapUrl"},"stepLog":"21:41:39.378 🔢 Users to create: 5 \n"},{"result":{"nanos":1624400,"startTime":1753632699382,"endTime":1753632699384,"millis":1.6244,"status":"passed"},"step":{"line":8,"prefix":"*","index":0,"text":"def username = 'admin@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":1058200,"startTime":1753632699384,"endTime":1753632699385,"millis":1.0582,"status":"passed"},"step":{"line":9,"prefix":"*","index":1,"text":"def password = 'z1mbr4@123'"}},{"result":{"nanos":1235800,"startTime":1753632699385,"endTime":1753632699386,"millis":1.2358,"status":"passed"},"step":{"line":10,"prefix":"*","index":2,"text":"def authType = 'id'"}},{"result":{"nanos":7628900,"startTime":1753632699386,"endTime":1753632699394,"millis":7.6289,"status":"passed"},"step":{"line":11,"prefix":"*","index":3,"text":"def soaprequest = karate.read('classpath:requests\/authRequest.xml')"}},{"result":{"nanos":339100,"startTime":1753632699394,"endTime":1753632699394,"millis":0.3391,"status":"passed"},"step":{"line":12,"prefix":"Given","index":4,"text":"request soaprequest"}},{"result":{"nanos":599100,"startTime":1753632699395,"endTime":1753632699396,"millis":0.5991,"status":"passed"},"step":{"line":13,"prefix":"And","index":5,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":2632800,"startTime":1753632699395,"endTime":1753632699398,"millis":2.6328,"status":"passed"},"step":{"line":14,"prefix":"*","index":6,"text":"configure ssl = true"}},{"result":{"nanos":213509200,"startTime":1753632699398,"endTime":1753632699612,"millis":213.5092,"status":"passed"},"step":{"line":15,"prefix":"When","index":7,"text":"method POST"},"stepLog":"21:41:39.403 request:\n1 > POST https:\/\/80.225.207.85:9071\/service\/admin\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 419\n1 > Host: 80.225.207.85:9071\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soapenv:Envelope xmlns:soapenv=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\" xmlns:urn=\"urn:zimbra\" xmlns:urn1=\"urn:zimbraAdmin\">\r\n   <soapenv:Header>\r\n      \r\n   <\/soapenv:Header>\r\n   <soapenv:Body>\r\n    <urn1:AuthRequest>\r\n\t    <urn1:account by=\"id\">admin@qa-u56-singlenode-ps.eng.zimbra.com<\/urn1:account>\r\n\t    <urn1:password>z1mbr4@123<\/urn1:password>\r\n\t <\/urn1:AuthRequest>\r\n   <\/soapenv:Body>\r\n<\/soapenv:Envelope>\n\n21:41:39.607 response time in milliseconds: 201\n1 < 500\n1 < Server: nginx\n1 < Date: Sun, 27 Jul 2025 16:11:36 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 441\n1 < Connection: keep-alive\n1 < Cache-Control: no-store, no-cache\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33074:1753632696711:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":10021400,"errorMessage":"status code was: 500, expected: 200, response time in milliseconds: 201, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33074:1753632696711:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16","startTime":1753632699612,"endTime":1753632699622,"millis":10.0214,"status":"failed"},"step":{"line":16,"prefix":"Then","index":8,"text":"status 200"},"stepLog":"21:41:39.623 classpath:features\/Login.feature:16\nThen status 200\nstatus code was: 500, expected: 200, response time in milliseconds: 201, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33074:1753632696711:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16\n"},{"result":{"nanos":0,"startTime":1753632699623,"endTime":1753632699623,"millis":0.0,"status":"skipped"},"step":{"line":17,"prefix":"*","index":9,"text":"def authToken = karate.xmlPath(response, '\/\/authToken')"}},{"result":{"nanos":0,"startTime":1753632699623,"endTime":1753632699623,"millis":0.0,"status":"skipped"},"step":{"line":18,"prefix":"*","index":10,"text":"print 'Auth Token is:', authToken"}}],"line":21,"description":"","durationMillis":239.7348,"failed":true,"error":"status code was: 500, expected: 200, response time in milliseconds: 201, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33074:1753632696711:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16","tags":["authTokenGeneration_Valid"],"executorName":"main","name":"Zimbra user login","startTime":1753632699373,"refId":"[1.2:21]","endTime":1753632699623,"exampleData":{"username":"admin@qa-u56-singlenode-ps.eng.zimbra.com","password":"z1mbr4@123","authType":"id"},"exampleIndex":1},{"sectionIndex":0,"stepResults":[{"result":{"nanos":405500,"startTime":1753632699670,"endTime":1753632699670,"millis":0.4055,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url adminSoapUrl"},"stepLog":"21:41:39.663 🔢 Users to create: 5 \n"},{"result":{"nanos":585200,"startTime":1753632699670,"endTime":1753632699671,"millis":0.5852,"status":"passed"},"step":{"line":8,"prefix":"*","index":0,"text":"def username = 'admin@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":715600,"startTime":1753632699671,"endTime":1753632699672,"millis":0.7156,"status":"passed"},"step":{"line":9,"prefix":"*","index":1,"text":"def password = 'z1mbr4@123'"}},{"result":{"nanos":1130100,"startTime":1753632699672,"endTime":1753632699673,"millis":1.1301,"status":"passed"},"step":{"line":10,"prefix":"*","index":2,"text":"def authType = 'foreignPrincipal'"}},{"result":{"nanos":5344800,"startTime":1753632699673,"endTime":1753632699678,"millis":5.3448,"status":"passed"},"step":{"line":11,"prefix":"*","index":3,"text":"def soaprequest = karate.read('classpath:requests\/authRequest.xml')"}},{"result":{"nanos":300900,"startTime":1753632699678,"endTime":1753632699678,"millis":0.3009,"status":"passed"},"step":{"line":12,"prefix":"Given","index":4,"text":"request soaprequest"}},{"result":{"nanos":189300,"startTime":1753632699679,"endTime":1753632699679,"millis":0.1893,"status":"passed"},"step":{"line":13,"prefix":"And","index":5,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":2988000,"startTime":1753632699679,"endTime":1753632699682,"millis":2.988,"status":"passed"},"step":{"line":14,"prefix":"*","index":6,"text":"configure ssl = true"}},{"result":{"nanos":5972774700,"startTime":1753632699682,"endTime":1753632705655,"millis":5972.7747,"status":"passed"},"step":{"line":15,"prefix":"When","index":7,"text":"method POST"},"stepLog":"21:41:39.687 request:\n1 > POST https:\/\/80.225.207.85:9071\/service\/admin\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 433\n1 > Host: 80.225.207.85:9071\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soapenv:Envelope xmlns:soapenv=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\" xmlns:urn=\"urn:zimbra\" xmlns:urn1=\"urn:zimbraAdmin\">\r\n   <soapenv:Header>\r\n      \r\n   <\/soapenv:Header>\r\n   <soapenv:Body>\r\n    <urn1:AuthRequest>\r\n\t    <urn1:account by=\"foreignPrincipal\">admin@qa-u56-singlenode-ps.eng.zimbra.com<\/urn1:account>\r\n\t    <urn1:password>z1mbr4@123<\/urn1:password>\r\n\t <\/urn1:AuthRequest>\r\n   <\/soapenv:Body>\r\n<\/soapenv:Envelope>\n\n21:41:45.650 response time in milliseconds: 5960\n1 < 500\n1 < Server: nginx\n1 < Date: Sun, 27 Jul 2025 16:11:42 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 441\n1 < Connection: keep-alive\n1 < Cache-Control: no-store, no-cache\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33069:1753632702754:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":245300,"errorMessage":"status code was: 500, expected: 200, response time in milliseconds: 5960, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33069:1753632702754:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16","startTime":1753632705655,"endTime":1753632705655,"millis":0.2453,"status":"failed"},"step":{"line":16,"prefix":"Then","index":8,"text":"status 200"},"stepLog":"21:41:45.656 classpath:features\/Login.feature:16\nThen status 200\nstatus code was: 500, expected: 200, response time in milliseconds: 5960, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33069:1753632702754:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16\n"},{"result":{"nanos":0,"startTime":1753632705656,"endTime":1753632705656,"millis":0.0,"status":"skipped"},"step":{"line":17,"prefix":"*","index":9,"text":"def authToken = karate.xmlPath(response, '\/\/authToken')"}},{"result":{"nanos":0,"startTime":1753632705656,"endTime":1753632705656,"millis":0.0,"status":"skipped"},"step":{"line":18,"prefix":"*","index":10,"text":"print 'Auth Token is:', authToken"}}],"line":21,"description":"","durationMillis":5984.6794,"failed":true,"error":"status code was: 500, expected: 200, response time in milliseconds: 5960, url: https:\/\/80.225.207.85:9071\/service\/admin\/soap\/, response: \n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"\/><\/soap:Header><soap:Body><soap:Fault><faultcode>soap:Client<\/faultcode><faultstring>permission denied: Error in Authentication<\/faultstring><detail><Error xmlns=\"urn:zimbra\"><Code>service.PERM_DENIED<\/Code><Trace>qtp1150284200-33069:1753632702754:2f4ae0e4a8b94020<\/Trace><\/Error><\/detail><\/soap:Fault><\/soap:Body><\/soap:Envelope>\nclasspath:features\/Login.feature:16","tags":["authTokenGeneration_Valid"],"executorName":"main","name":"Zimbra user login","startTime":1753632699660,"refId":"[1.3:21]","endTime":1753632705656,"exampleData":{"username":"admin@qa-u56-singlenode-ps.eng.zimbra.com","password":"z1mbr4@123","authType":"foreignPrincipal"},"exampleIndex":2}],"callDepth":0,"name":"Login to Zimbra using SOAP API","description":"","resultDate":"2025-07-27 09:41:45 pm","durationMillis":8262.6344,"passedCount":1}